

void Experiment() {
  Lab_01();
  Lab_02();
  Lab_03();
  Lab_04();
  ao();
}

void Lab_01() {
  // 1. เดินเกาะเส้นเจอแยกขวา -> ข้ามเส้นให้ล้ออยู่ตรงจุดหมุน -> หมุนขวา
  // track_CR(20);
  // fd2(20, 20);
  // delay(800);  // เดินหน้าต่อให้ล้ออยู่บนเส้นตัด
  // ao();
  // delay(1000);
  // ssr(30);  // หมุนขวาจนเจอเส้น
  // waitSW_OK();

  // // 2. เดินเกาะเส้นเจอแยก -> ข้ามเส้น -> หมุนซ้าย
  // track_CR(20);
  // fd2(20, 20);
  // delay(800);
  // ao();
  // delay(1000);
  // ssl(30);  // หมุนซ้ายจนเจอเส้น
  // waitSW_OK();

  // // 3. เดินเกาะเส้นเจอแยก -> ข้ามเส้น -> หมุนซ้าย
  // track_jc(20);
  // fd2(20, 20);
  // delay(800);
  // ao();
  // delay(1000);
  // ssl(30);  // หมุนซ้ายจนเจอเส้น
  // waitSW_OK();

  // // 4. เดินเกาะเส้นเจอแยกซ้าย -> ข้ามเส้น -> หมุนซ้าย
  // track_CL(20);
  // fd2(20, 20);
  // delay(800);
  // ao();
  // delay(1000);
  // ssl(30);  // หมุนซ้ายจนเจอเส้น
  // waitSW_OK();

  // // --- Lap 2 ---
  // delay(1500);

  // // 5. เดินเกาะเส้นเจอแยก -> ข้ามเส้น -> หมุนซ้าย
  // track_CR(20);
  // fd2(20, 21.2);
  // delay(800);
  // ao();
  // delay(1000);
  // ssl(30);  // หมุนซ้ายจนเจอเส้น
  // waitSW_OK();

  // 6. ข้าม 2 เส้นตัด (skip_Line 2 ครั้ง)
  // ข้ามเส้นตัดที่ 1
  track_CL(20);
  fd2(20, 30);
  delay(800);
  ao();
  waitSW_OK();
  // ข้ามเส้นตัดที่ 2
  track_CR(20);
  fd2(20, 21.2);
  delay(800);
  ao();
  delay(1000);
  waitSW_OK();

  // 7. หมุนซ้ายจุดสุดท้าย
  ssl(30);  // หมุนซ้ายจนเจอเส้น

  ao();  // หยุดการทำงานเมื่อจบภารกิจ
}

void Lab_02() {
  // พื้นที่สำหรับ Lab 02
}

void Lab_03() {
  // พื้นที่สำหรับ Lab 03
}

void Lab_04() {
  // พื้นที่สำหรับ Lab 04
}