#include <POP32.h>  // เรียก library(โปรแกรมที่เขียนไว้) ของบอร์ด
//************** กำหนดตัวแปรแบบสาธารณะ *********************************
void setup() {
  // พื้นที่เขียนโปรแกรม
  oled.clear();              // เคลียหน้าจอ
  oled.text(0, 0, "SW_OK");  // ตำแหน่ง 0,0 แสดง "SW_OK"
  oled.show();               // สั่งอัปเดทหน้าจอ *ต้องมีคำสั่งนี้ถึงจะแสดง
  waitSW_OK();               // รอกดปุ่ม OK  เมื่อกดปุ่ม OK ก็จะทำงานบรรทัดต่อไป
  oled.clear();              // เคลียหน้าจอ
  oled.text(0, 0, "RUN..");  // ตำแหน่ง 0,0 แสดง "RUN.."
  oled.show();               // สั่งอัปเดทหน้าจอ *ต้องมีคำสั่งนี้ถึงจะแสดง
}


void loop() {
  // * ปล่อยว่างไว้
}
