#include <POP32.h>
// *** กำหนดค่ากลางเซ็นเซอร์แต่ละตัวตามสไลด์
int mid_L = 2663;  // ค่าอ้างอิงกึ่งกลางเซ็นเซอร์ a1 (ซ้ายสุด)
int mid_l = 1814;  // ค่าอ้างอิงกึ่งกลางเซ็นเซอร์ a3 (ซ้ายใน)
int mid_r = 2813;  // ค่าอ้างอิงกึ่งกลางเซ็นเซอร์ a6 (ขวาใน)
int mid_R = 2554;  // ค่าอ้างอิงกึ่งกลางเซ็นเซอร์ a8 (ขวาสุด)
void setup() {
  oled.clear();              // เคลียหน้าจอ
  oled.text(0, 0, "SW_OK");  // ตำแหน่ง 0,0 แสดง "SW_OK"
  oled.show();               // สั่งอัปเดทหน้าจอ *ต้องมีคำสั่งนี้ถึงจะแสดง
  waitSW_OK();               // รอกดปุ่ม OK  เมื่อกดปุ่ม OK ก็จะทำงานบรรทัดต่อไป
  oled.clear();              // เคลียหน้าจอ
  oled.text(0, 0, "RUN..");
  oled.show();  // สั่งอัปเดทหน้าจอ *ต้องมีคำสั่งนี้ถึงจะแสดง
  // show_analog(); // แสดงค่าเซ็นเซอร์จับเส้น 4 ตัวด้านหน้า
  // track_line(20);  // เกาะเส้นทดสอบว่าเกาะได้ไหม
  track_jc(20);
}

void loop() {
  // put your main code here, to run repeatedly:
}
